# CRUD Operation with SQLite3

In [45]:
import sqlite3

## Helping Functions

In [46]:
def execute_sql(dbname, sql):
    # Connect to database
    try:
        connection = sqlite3.connect(dbname)
        # Create a cursor object to iterate the database
        cursor = connection.cursor()
        cursor.execute(sql)
        # Commit the transaction
        connection.commit()
        print(f"{cursor.rowcount}")
    #Catch exception
    except sqlite3.IntegrityError as e:
        print(f"Integrity error: {e}")
    except sqlite3.Error as e:
        print(f"An DB error occurred: {e}")
    except Exception as ex:
        print(f"An Exception has occurred: {ex}")
    finally:
        cursor.close()
        connection.close()

def execute_many(dbname, sql, list_param):
    # Connect to database
    try:
        connection = sqlite3.connect(dbname)
        # Create a cursor object to iterate the database
        cursor = connection.cursor()
        cursor.executemany(sql, list_param)
        # Commit the transaction
        connection.commit()
        print(f"{cursor.rowcount}")
    #Catch exception
    except sqlite3.IntegrityError as e:
        print(f"Integrity error: {e}")
    except sqlite3.Error as e:
        print(f"An DB error occurred: {e}")
    except Exception as e:
        print(f"An Exception has occurred: {e}")
    finally:
        cursor.close()
        connection.close()

def execute_fetchall(dbname, sql):
    try:
        connection = sqlite3.connect(dbname)
        cursor = connection.cursor()
        cursor.execute(sql)
        rows = cursor.fetchall()
        
        for row in rows:
            print(row)
    #Catch exception
    except sqlite3.IntegrityError as e:
        print(f"Integrity error: {e}")
    except sqlite3.Error as e:
        print(f"An DB error occurred: {e}")
    except Exception as ex:
        print(f"An Exception has occurred: {ex}")
    finally:
        cursor.close()
        connection.close()

## Create Database (If not already exists)

In [50]:
db = 'mycompany.db'
sql = '''
    CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    email TEXT NOT NULL UNIQUE,
    phone TEXT NOT NULL UNIQUE,
    address TEXT NOT NULL,
    department TEXT,
    salary REAL
    )
'''

execute_sql(db, sql)

-1

## Insert Data

In [51]:
## Insert the data in SQLlite table

# List of employee records to insert
employees = [
    ('Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1'),
    ('Employee 2', 'emp2@mycompany.com', '+923001000002', 'Employee 2 House#, Street 2, District 2, City 2, Country 1, Zip/Postal 2'),
    ('Employee 3', 'emp3@mycompany.com', '+923001000003', 'Employee 3 House#, Street 3, District 3, City 3, Country 1, Zip/Postal 3'),
    ('Employee 4', 'emp4@mycompany.com', '+923001000004', 'Employee 4 House#, Street 4, District 4, City 4, Country 1, Zip/Postal 4')
]

sql = '''
    INSERT INTO employees (name, email, phone, address)
    VALUES (?, ?, ?, ?)
'''

execute_many(db, sql, employees)

4

## Query Data

In [52]:
sql = '''
    SELECT * FROM employees
'''

execute_fetchall(db, sql)

(1, 'Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1', None, None)
(2, 'Employee 2', 'emp2@mycompany.com', '+923001000002', 'Employee 2 House#, Street 2, District 2, City 2, Country 1, Zip/Postal 2', None, None)
(3, 'Employee 3', 'emp3@mycompany.com', '+923001000003', 'Employee 3 House#, Street 3, District 3, City 3, Country 1, Zip/Postal 3', None, None)
(4, 'Employee 4', 'emp4@mycompany.com', '+923001000004', 'Employee 4 House#, Street 4, District 4, City 4, Country 1, Zip/Postal 4', None, None)

## Update Data

In [56]:
salary = 10000

sql = f'''
    UPDATE employees
    SET salary = {salary * 1.1}, department = 'Department 1'
    WHERE id = 1
'''

execute_sql(db, sql)

1

In [57]:
sql = '''
    SELECT * FROM employees Where id = 1
'''

execute_fetchall(db, sql)

(1, 'Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1', 'Department 1', 11000.0)

## Delete Data

In [59]:
sql = '''
    INSERT INTO employees (name, email, phone, address, department, salary)
    VALUES ('Emp 5', 'emp5@mycompany.com', '+923001000005', 'Emp 5 House#, Street 5, District 5, City 5, Country 1, Zip/Postal 5', 'Dept 1', 10400)
'''

execute_sql(db, sql)

1

In [60]:
sql = '''
    SELECT * FROM employees
'''

execute_fetchall(db, sql)

(1, 'Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1', 'Department 1', 11000.0)
(2, 'Employee 2', 'emp2@mycompany.com', '+923001000002', 'Employee 2 House#, Street 2, District 2, City 2, Country 1, Zip/Postal 2', None, None)
(3, 'Employee 3', 'emp3@mycompany.com', '+923001000003', 'Employee 3 House#, Street 3, District 3, City 3, Country 1, Zip/Postal 3', None, None)
(4, 'Employee 4', 'emp4@mycompany.com', '+923001000004', 'Employee 4 House#, Street 4, District 4, City 4, Country 1, Zip/Postal 4', None, None)
(5, 'Emp 5', 'emp5@mycompany.com', '+923001000005', 'Emp 5 House#, Street 5, District 5, City 5, Country 1, Zip/Postal 5', 'Dept 1', 10400.0)

In [61]:
sql = '''
    DELETE FROM employees Where id = 5
'''

execute_sql(db, sql)

1

In [62]:
sql = '''
    SELECT * FROM employees
'''

execute_fetchall(db, sql)

(1, 'Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1', 'Department 1', 11000.0)
(2, 'Employee 2', 'emp2@mycompany.com', '+923001000002', 'Employee 2 House#, Street 2, District 2, City 2, Country 1, Zip/Postal 2', None, None)
(3, 'Employee 3', 'emp3@mycompany.com', '+923001000003', 'Employee 3 House#, Street 3, District 3, City 3, Country 1, Zip/Postal 3', None, None)
(4, 'Employee 4', 'emp4@mycompany.com', '+923001000004', 'Employee 4 House#, Street 4, District 4, City 4, Country 1, Zip/Postal 4', None, None)